{
	"lectures": {
		"lecture": [
			"The difference between the novice and the master is that the master has failed more times than the novice has tried.",
			"Is anything ever truly wasted?",
			"Exams are an opportunity to teach correctly the meaning of winning and losing, of strong and weak. Students soak up heaping helpings of successes and setbacks! Take in now what it means to win, what it means to lose!",
			"Please remember that there are times to take someone's hand and lead them along... But also times when you must be stern and let them fend for themselves.",
			"Whether a fish lives in a clear stream or a water ditch, so long as it continues swimming forward, it will grow up beautifully.",
			"The world will always be filled with injustice. If you have time to give up or hold a grudge against that injustice, then use that time to enjoy battling those injustices instead.",
			"Those who can't do what they have to when the time comes for action will find their presence fading in our classroom. An assassin who neglects to sharpen his blade is no assassin at all. He's just a boastful brat swinging around a rusty sword.",
			"Tests are a good thing. The knowledge gained from a night of cramming will be all but forgotten once you hit adulthood. And that's fine. The experience you gain through competition, having sharpened your skills and broadened your minds all under the same set of rules? That's the real treasure.",
			"If I wasn't prepared to be flexible as the situations demands, I wouldn't have become a teacher."
		]
	},
	"responses": [
		{
			"trigger": "hello korosensei",
			"message": [
				"Hello __, my precious student!",
				"It's great to see your smiling face __!",
				"Hello __! Ready for a day of learning?",
				"__, always happy to see me. Makes me feel like doing my best",
				"__! My proudest student!"
			]
		},
		{
			"trigger": "good morning korosensei",
			"message": [
				"good morning to you too __ :sun_with_face:",
				"hiya __!",
				"great to see you __!",
				"ready for today's lesson __?",
				"__!!, did you eat your breakfast yet? A growing mind needs a good breakfast! :bread:"
			]
		},
		{
			"trigger": "hi korosensei",
			"message": [
				"__! it's nice to see you!",
				"hi __!",
				"great to see you __!",
				"ready for today's lesson __?",
				"hi __, working hard as always?"
			]
		},
		{
			"trigger": "korosensei help me",
			"message": [
				"IM COMING TO YOUR RESCUE __!",
				"My student needs me and I have to be there for __!",
				"__, everything will be alright because I'm here!",
				"I will not rest till I can be of help __!"
			]
		},
		{
			"trigger": "good night korosensei",
			"message": [
				"Good night __, my precious student :pinkkorosensei:! See you bright and early tomorrow for class! ",
				"Great work today __! You sleep well, you deserve it.",
				"Nighty night __!",
				"W..what?! __, I didn't know you were still here -hides magazine- :pinkkorosensei:"
			]
		},
		{
			"trigger": "i'm bored korosensei",
			"message": [
				"Great! That means you'll have time to write that 30 page essay __?",
				"A true assassin is never bored, but patient!",
				"Bordem means you're ready to experience and grow!",
				"I'm always free to help a student in need!",
				"Nice tactic __! Trying to look like you have nothing to do so I lower my guard so you can go in for a sneak assassination!"
			]
		}
	]
}